# 3way handshake

![image](https://postfiles.pstatic.net/20110805_24/twers_1312510723790XRXhf_JPEG/tcp_3_way_hand_shake.jpg?type=w2)

TCP 는 신뢰성을 확보할 때 **3way handshake** 작업을 진행한다

클라이언트와 서버가 통신할 때 다음 3 단계의 과정을 거친다

1. SYN 단계 : 클라이언트는 서버에 클라이언트 ISN 을 담아 SYN 을 보낸다 ( 요청 플래그 )

*ISN 은 새로운 TCP 연결의 첫번째 패킷에 할당된 임의 시퀀스 번호를 말하며 장치마다 상이하다*

2. SYN + ACK 단계 : 서버는 클라이언트의 SYN 을 수신하고 서버의 ISN 을 보내며 승인번호로 ISN+1 을 보낸다 ( 응답 플래그 )

3. ACK 단계 : 클라이언트는 서버의 ISN+1 한 값인 승인번호를 담아 ACK 를 서버에 보낸다

위와 같은 단계를 거친 후 신뢰성이 구축되면 데이터 전송을 시작한다

UDP 는 이 과정이 없기 때문에 신뢰성이 없는 계층이라 한다

---
# 4way handshake

![image](https://postfiles.pstatic.net/20110805_100/twers_13125107241707F4z1_JPEG/tcp_4_way_hand_shake.jpg?type=w2)

TCP 가 연결을 해제할때 **4way handshake** 작업을 진행한다

1. 먼저 클라이언트가 연결을 닫으려고 할때 FIN 으로 설정된 세그먼트를 전송한다

클라이언트는 FIN_WAIT_1 상태로 들어가고 서버의 응답을 기다린다

2. 서버는 클라이언트로 ACK 라는 승인 세그먼트를 보낸 후 CLOSE_WAIT 상태로 들어간다

클라이언트가 세그먼트를 받으면 FIN_WAIT_2 상태에 들어간다

3. 서버는 일정시간 이후에 클라이언트에 FIN 이라는 세그먼트를 보낸다

4. 클라이언트는 TIME_WAIT 상태가 되고 다시 서버로 ACK 를 보내 서버는 CLOSED 상태가 된다

이후 클라이언트는 어느 정도 대기한 후 연결이 닫히고 클라이언트와 서버의 모든 자원의 연결이 해제된다


## TIME_WAIT 상태 후 종료하는 이유 ?! ( 2가지 )

- **지연 패킷이 발생할 경우를 대비하기 위함**이다 !
패킷이 뒤늦게 도달하고 이를 처리하지 못한다면 데이터 무결성 문제가 발생한다

- **두 장치가 연결이 닫혔는지 확인하기 위함**이다 !
만약 LAST_ACK 상태에서 닫히게 되면 다시 새로운 연결을 하려할 때 접속 오류 문제가 발생한다
